/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50624
Source Host           : localhost:3306
Source Database       : supermarket

Target Server Type    : MYSQL
Target Server Version : 50624
File Encoding         : 65001

Date: 2021-07-21 16:21:10
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for sale
-- ----------------------------
DROP TABLE IF EXISTS `sale`;
CREATE TABLE `sale` (
  `said` int(11) NOT NULL AUTO_INCREMENT,
  `saodd` varchar(100) NOT NULL,
  `vid` int(11) NOT NULL,
  `sadate` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `saztai` int(1) NOT NULL DEFAULT '0' COMMENT '0 审核 1未审核',
  `sacope` decimal(10,2) NOT NULL,
  `sapaid` decimal(10,2) NOT NULL,
  `saagent` varchar(100) NOT NULL,
  PRIMARY KEY (`said`),
  UNIQUE KEY `said` (`said`)
) ENGINE=InnoDB AUTO_INCREMENT=56 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sale
-- ----------------------------
INSERT INTO `sale` VALUES ('1', 'SB1232131', '1', '2021-06-17 19:27:26', '0', '12.00', '12.00', '兰凯军');
INSERT INTO `sale` VALUES ('2', 'MB321313122', '2', '2021-06-26 19:26:43', '0', '5.00', '5.00', '兰凯军');
INSERT INTO `sale` VALUES ('3', 'QB414211213', '3', '2021-06-19 19:27:43', '0', '43.00', '43.00', '兰凯军');
INSERT INTO `sale` VALUES ('4', 'HP231313132', '4', '2021-06-17 19:28:59', '0', '14.00', '14.00', '兰凯军');
INSERT INTO `sale` VALUES ('5', 'xiao111', '1', '2020-01-01 00:00:00', '0', '21.30', '32.20', '小唯');
INSERT INTO `sale` VALUES ('6', 'xs20210708112858', '0', '2021-07-08 11:29:11', '0', '4.00', '4.00', '小唯');
INSERT INTO `sale` VALUES ('7', 'xs20210708113047', '0', '2021-07-08 11:31:11', '0', '51.00', '51.00', '小唯');
INSERT INTO `sale` VALUES ('8', 'xs20210708113444', '0', '2021-07-08 11:35:01', '0', '111.00', '111.00', '小唯');
INSERT INTO `sale` VALUES ('9', 'xs20210708113606', '0', '2021-07-08 11:36:22', '0', '14.50', '14.50', '小唯');
INSERT INTO `sale` VALUES ('10', 'xs20210708020040', '0', '2021-07-08 14:00:59', '0', '240.00', '240.00', '小唯');
INSERT INTO `sale` VALUES ('11', 'xs20210708020101', '0', '2021-07-08 14:01:22', '0', '120.00', '120.00', '小唯');
INSERT INTO `sale` VALUES ('12', 'xs20210708021314', '0', '2021-07-08 14:13:39', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('13', 'xs20210708021314', '0', '2021-07-08 14:13:44', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('14', 'xs20210708021314', '0', '2021-07-08 14:13:46', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('15', 'xs20210708021314', '0', '2021-07-08 14:13:46', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('16', 'xs20210708021314', '0', '2021-07-08 14:13:47', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('17', 'xs20210708021314', '0', '2021-07-08 14:13:47', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('18', 'xs20210708021314', '0', '2021-07-08 14:13:47', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('19', 'xs20210708021314', '0', '2021-07-08 14:13:47', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('20', 'xs20210708021400', '0', '2021-07-08 14:14:09', '0', '36.00', '36.00', '小唯');
INSERT INTO `sale` VALUES ('21', 'xs20210708021528', '0', '2021-07-08 14:15:40', '0', '48.00', '48.00', '小唯');
INSERT INTO `sale` VALUES ('22', 'xs20210708021902', '0', '2021-07-08 14:19:30', '0', '102.00', '102.00', '小唯');
INSERT INTO `sale` VALUES ('23', 'xs20210708022402', '0', '2021-07-08 14:24:45', '1', '42.00', '42.00', '小唯');
INSERT INTO `sale` VALUES ('24', 'xs20210708042618', '0', '2021-07-08 16:26:26', '0', '48.00', '48.00', '小唯');
INSERT INTO `sale` VALUES ('25', 'xs20210709084215', '0', '2021-07-09 08:42:25', '0', '8.50', '8.50', '小唯');
INSERT INTO `sale` VALUES ('26', 'xs20210709020304', '0', '2021-07-09 14:03:30', '1', '8.50', '8.50', '小唯');
INSERT INTO `sale` VALUES ('27', 'xs20210712093707', '0', '2021-07-12 09:37:28', '0', '5.00', '5.00', '小唯');
INSERT INTO `sale` VALUES ('28', 'xs20210713020615', '0', '2021-07-13 14:06:36', '0', '10.00', '10.00', '小唯');
INSERT INTO `sale` VALUES ('29', 'xs20210713031340', '0', '2021-07-13 15:16:53', '0', '53.00', '53.00', '小唯');
INSERT INTO `sale` VALUES ('30', 'xs20210713031655', '0', '2021-07-13 15:17:19', '0', '40.00', '40.00', '小唯');
INSERT INTO `sale` VALUES ('31', 'xs20210716025914', '1', '2021-07-16 14:59:26', '0', '5.00', '5.00', '某某某');
INSERT INTO `sale` VALUES ('32', 'xs20210716030307', '1', '2021-07-16 15:03:17', '0', '5.00', '5.00', '某某某');
INSERT INTO `sale` VALUES ('33', 'xs20210718021254', '1', '2021-07-18 14:13:34', '0', '71.00', '71.00', '小岚');
INSERT INTO `sale` VALUES ('34', 'xs20210718021553', '1', '2021-07-18 14:16:17', '0', '28.00', '28.00', '小岚');
INSERT INTO `sale` VALUES ('35', 'xs1626653706812', '1', '2021-07-19 08:15:45', '0', '36.00', '36.00', '某某某');
INSERT INTO `sale` VALUES ('36', 'xs20210719090124', '2', '2021-07-19 09:01:36', '0', '28.50', '28.50', '小军');
INSERT INTO `sale` VALUES ('37', 'xs20210719090152', '2', '2021-07-19 09:02:11', '0', '11.50', '11.50', '小军');
INSERT INTO `sale` VALUES ('38', 'xs20210719090213', '2', '2021-07-19 09:02:43', '0', '28.50', '28.50', '小军');
INSERT INTO `sale` VALUES ('39', 'xs1626656572049', '4', '2021-07-19 09:03:27', '0', '4.05', '10.00', '小军');
INSERT INTO `sale` VALUES ('40', 'xs20210719093559', '2', '2021-07-19 09:36:11', '0', '29.00', '29.00', '小军');
INSERT INTO `sale` VALUES ('41', 'xs20210719093631', '2', '2021-07-19 09:36:47', '0', '24.00', '24.00', '小军');
INSERT INTO `sale` VALUES ('42', 'xs20210719093649', '2', '2021-07-19 09:37:14', '0', '24.00', '24.00', '小军');
INSERT INTO `sale` VALUES ('43', 'xs1626658641246', '4', '2021-07-19 09:37:39', '0', '3.60', '10.00', '小军');
INSERT INTO `sale` VALUES ('44', 'xs20210719125600', '1', '2021-07-19 12:56:50', '0', '4.00', '4.00', '小伟');
INSERT INTO `sale` VALUES ('45', 'xs20210719125651', '1', '2021-07-19 12:57:02', '0', '4.00', '4.00', '小伟');
INSERT INTO `sale` VALUES ('46', 'xs1626670659610', '4', '2021-07-19 12:58:22', '0', '5.00', '5.00', '小伟');
INSERT INTO `sale` VALUES ('47', 'xs20210719020513', '3', '2021-07-19 14:05:49', '0', '538.00', '538.00', '小军');
INSERT INTO `sale` VALUES ('48', 'xs20210719020611', '1', '2021-07-19 14:06:24', '0', '10.00', '10.00', '小军');
INSERT INTO `sale` VALUES ('49', 'xs20210719020624', '1', '2021-07-19 14:06:56', '0', '216.00', '216.00', '小军');
INSERT INTO `sale` VALUES ('50', 'xs20210719020712', '1', '2021-07-19 14:07:52', '0', '576.00', '576.00', '小军');
INSERT INTO `sale` VALUES ('51', 'xs20210719020753', '1', '2021-07-19 14:08:27', '0', '378.00', '378.00', '小军');
INSERT INTO `sale` VALUES ('52', 'xs20210719020828', '1', '2021-07-19 14:09:03', '0', '129.00', '129.00', '小军');
INSERT INTO `sale` VALUES ('53', 'xs20210719020904', '1', '2021-07-19 14:10:44', '0', '216.00', '216.00', '小军');
INSERT INTO `sale` VALUES ('54', 'xs1626675052668', '4', '2021-07-19 14:11:13', '0', '4.50', '10.00', '小军');
INSERT INTO `sale` VALUES ('55', 'xs1626675086415', '1', '2021-07-19 14:11:51', '0', '1818.00', '1810.00', '小军');
